zhanzr/xmc4700-relax-kit-demo/crc_perf.c
#include <stdio.h>
#include <stdint.h>
#include <stdlib.h>
#include <assert.h>
#include <math.h>

#include <arm_math.h>

#include "utilis.h"

#include <XMC4700.h>
#include <xmc_scu.h>
#include <xmc_fce.h>

/*Data Packet 1 */
int8_t usecase1_Data1[] = "Lorem ipsum dolor sit amet, ";
/*Data Packet 2 */
int8_t usecase1_Data2[] = "consectetur adipiscing elit. Donec metus eros, a";
/*Data Packet 3 */
int8_t usecase1_Data3[] =
    "ccumsan ut vestibulum id, suscipit nec augue. Aenean et lectus ut libero "
    "lacinia faucibus ut vel lectus. Pellentesque iaculis libero ac lectus "
    "blandit accumsan. Pellentesque at nulla eget metus aliquam tincidunt. "
    "Aenean cursus purus vitae lacus cursus pharetra. In hac habitasse platea "
    "dictumst. Curabitur nulla odio, porttitor eu pharetra at, pulvinar "
    "gravida velit. Aenean eu dapibus purus. Proin blandit feugiat urna, at "
    "iaculis elit accumsan ut. Pellentesque molestie pharetra erat, eget "
    "semper urna vehicula nec. Nam tristique sollicitudin diam, faucibus "
    "aliquet velit pharetra a. Duis a placerat risus. Phasellus vel diam nibh, "
    "quis elementum nisl. Phasellus lectus quam, mollis eu consequat ut, "
    "bibendum eget arcu. Nullam at felis a elit auctor suscipit eu quis ipsum. "
    "Mauris luctus, diam sit amet iaculis malesuada, urna orci convallis "
    "tellus, vitae molestie diam justo sed metus. Etiam volutpat volutpat "
    "justo, vel facilisis mi eleifend ut. Aenean egestas, sem eu vulputate "
    "lacinia, odio ligula mollis risus, a semper eros risus sed arcu. Sed "
    "feugiat augue eget erat bibendum vitae consequat purus tempus. Morbi "
    "lobortis nunc eget ligula vehicula non pharetra dolor commodo. "
    "Pellentesque ligula nibh, eleifend blandit aliquam vel, euismod non "
    "tellus. Quisque dictum laoreet feugiat. Maecenas a varius sapien. Ut "
    "semper nulla id turpis cursus ornare. Nullam quis erat et augue imperdiet "
    "pharetra nec a sem. Vestibulum ante ipsum primis in faucibus orci luctus "
    "et ultrices posuere cubilia Curae; Aenean feugiat, orci ultricies "
    "pellentesque viverra, nisl elit molestie augue, et scelerisque risus "
    "felis nec nulla. Maecenas congue arcu ac lectus bibendum at lacinia elit "
    "tristique. Cras fringilla vestibulum lectus. Praesent quis nisi turpis, "
    "sed tristique sem. Nam adipiscing posuere faucibus. In iaculis placerat "
    "semper. Curabitur in nunc quis enim vehicula aliquam quis at sapien. In "
    "hac habitasse platea orci aliquam...";

int8_t usecase1_Data4[] = "abcd";

uint8_t test_vec5[]= {0xAA, 0xBB }; // 0xF90A

/* FCE configuration for CRC32 operation using Kernal 0
 * Algorithm: IR Byte Wise Reflection disabled
 * 			: CRC 32-Bit Wise Reflection disabled
 *          : XOR with final CRC enabled
 * Initial seedvalue: 0U
 */
XMC_FCE_t FCE_config00 = {.kernel_ptr =
                              FCE_KE0, /**< FCE Kernel Pointer */
                          .fce_cfg_update.config_refin = XMC_FCE_REFIN_RESET,
                          .fce_cfg_update.config_refout = XMC_FCE_REFOUT_RESET,
                          .fce_cfg_update.config_xsel = XMC_FCE_INVSEL_RESET,
                          .seedvalue = 0U};

/* FCE configuration for CRC32 operation using Kernal 1
 * Algorithm: IR Byte Wise Reflection disabled
 * 			: CRC 32-Bit Wise Reflection disabled
 *          : XOR with final CRC disabled
 * Initial seedvalue: 0U
 */
XMC_FCE_t FCE_config1 = {.kernel_ptr =
                             FCE_KE1, /**< FCE Kernel Pointer */
                         .fce_cfg_update.config_refin = XMC_FCE_REFIN_RESET,
                         .fce_cfg_update.config_refout = XMC_FCE_REFOUT_RESET,
                         .fce_cfg_update.config_xsel = XMC_FCE_INVSEL_RESET,
                         .seedvalue = 0xFFFFFFFFU};

/* FCE configuration for CRC16 operation using Kernal 2
 * Algorithm: IR Byte Wise Reflection enabled
 * 			: CRC 32-Bit Wise Reflection disabled
 *          : XOR with final CRC disabled
 * Initial seedvalue: 0U
 */
XMC_FCE_t g_FCE_2 = {.kernel_ptr = FCE_KE2, /**< FCE Kernel Pointer */
                         .fce_cfg_update.config_refin = XMC_FCE_REFIN_RESET,
                         .fce_cfg_update.config_refout = XMC_FCE_REFOUT_RESET,
                         .fce_cfg_update.config_xsel = XMC_FCE_INVSEL_RESET,
                         .seedvalue = 0xFFFFU};

/* FCE configuration for CRC8 operation using Kernal 3
 * Algorithm: IR Byte Wise Reflection disabled
 * 			: CRC 32-Bit Wise Reflection disabled
 *          : XOR with final CRC disabled
 * Initial seedvalue: 0U
 */
XMC_FCE_t FCE_config3 = {.kernel_ptr = FCE_KE3, /**< FCE Kernel Pointer */
                         .fce_cfg_update.config_refin = XMC_FCE_REFIN_RESET,
                         .fce_cfg_update.config_refout = XMC_FCE_REFOUT_RESET,
                         .fce_cfg_update.config_xsel = XMC_FCE_INVSEL_RESET,
                         .seedvalue = 0U};

/**
  * @brief  This function is executed in case of Error_Handler occurrence.
  * @retval None
  */
static void Error_Handler(void) {
  printf("%s %d\n", __func__, __LINE__);

  while (1) {
    /* LED2 is blinking */
    // BSP_LED_Toggle(LED2);
    HAL_Delay(500);
  }
}

/** \brief This function calculates CRC.
*
* \param[in] length number of bytes in buffer
* \param[in] data pointer to data for which CRC should be calculated
* \param[out] crc pointer to 16-bit CRC
*/
void crc16_algorithm_1(uint8_t length, uint8_t *data, uint16_t *crc) {
  uint8_t counter;
  uint16_t crc_register = 0;
  // uint16_t crc_register = 0xffff;
	
#define POLY 0x1021
//#define POLY 0x8005

  uint8_t shift_register;
  uint8_t data_bit, crc_bit;
  for (counter = 0; counter < length; counter++) {
    for (shift_register = 0x01; shift_register > 0x00; shift_register <<= 1) {
      data_bit = (data[counter] & shift_register) ? 1 : 0;
      crc_bit = crc_register >> 15;
      crc_register <<= 1;
      if (data_bit != crc_bit)
        crc_register ^= POLY;
    }
  }
  *crc = crc_register;
}


