zhanzr/xmc4700-relax-kit-demo/crc_perf.c
unsigned short crc16_algorithm_2(uint16_t CRC_acc, uint8_t* p_input, uint32_t len) {
#define POLY 0x1021

    uint16_t CRC_acc_cal = CRC_acc;
  for(uint32_t idx = 0; idx < len; ++idx) {
      // Create the CRC "dividend" for polynomial arithmetic (binary arithmetic
      // with no carries)
      CRC_acc_cal = CRC_acc_cal ^ (p_input[idx] << 8);
      // "Divide" the poly into the dividend using CRC XOR subtraction
      // CRC_acc_cal holds the "remainder" of each divide
      //
      // Only complete this division for 8 bits since input is 1 byte
      for (uint8_t i = 0; i < 8; i++) {
        // Check if the MSB is set (if MSB is 1, then the POLY can "divide"
        // into the "dividend")
        if ((CRC_acc_cal & 0x8000) == 0x8000) {
          // if so, shift the CRC value, and XOR "subtract" the poly
          CRC_acc_cal = CRC_acc_cal << 1;
          CRC_acc_cal ^= POLY;
        } else {
          // if not, just shift the CRC value
          CRC_acc_cal = CRC_acc_cal << 1;
        }
      }
  }

  return CRC_acc_cal;
}


void crc_perfmance_test(void) {
  uint32_t start_ticks;
  uint32_t end_ticks;

  uint32_t Read_CRCResult32;
  uint16_t Read_CRCResult16;
  uint8_t Read_CRCResult8;
  uint32_t temp_length;
  uint32_t temp_mismatch;
  uint32_t CRC_result;
  bool flagstatus;
  XMC_FCE_STATUS_t fce_status;

  /* Enable FCE module */
  XMC_FCE_Enable();

  /* Initialize the FCE Configuration */
  //	XMC_FCE_Init(&FCE_config0);
  XMC_FCE_Init(&FCE_config1);
  XMC_FCE_Init(&g_FCE_2);
  XMC_FCE_Init(&FCE_config3);

  temp_mismatch = 0;

  //	/* Step 1: Performs a CRC32 check using Kernel 0 on Usecase1_Data1
  //	 * Seed value is set to 0.
  //	 * => CRC = 0xbb8d49a6, RES = 0x4472b659
  //	 */

  XMC_FCE_t *p_fce;

//  p_fce = &FCE_config00;
//  XMC_FCE_Init(p_fce);
//  XMC_FCE_CalculateCRC32(p_fce, (uint32_t *)usecase1_Data1,
//                         strlen((const char *)(usecase1_Data1)),
//                         &Read_CRCResult32);
//  XMC_FCE_GetCRCResult(p_fce, &CRC_result);
//  printf("Result: %08X\n", CRC_result);

//  p_fce = &FCE_config01;
//  XMC_FCE_Init(p_fce);
//  XMC_FCE_CalculateCRC32(p_fce, (uint32_t *)usecase1_Data1,
//                         strlen((const char *)(usecase1_Data1)),
//                         &Read_CRCResult32);
//  XMC_FCE_GetCRCResult(p_fce, &CRC_result);
//  printf("Result: %08X\n", CRC_result);

//  p_fce = &FCE_config02;
//  XMC_FCE_Init(p_fce);
//  XMC_FCE_CalculateCRC32(p_fce, (uint32_t *)usecase1_Data1,
//                         strlen((const char *)(usecase1_Data1)),
//                         &Read_CRCResult32);
//  XMC_FCE_GetCRCResult(p_fce, &CRC_result);
//  printf("Result: %08X\n", CRC_result);

//  p_fce = &FCE_config03;
//  XMC_FCE_Init(p_fce);
//  XMC_FCE_CalculateCRC32(p_fce, (uint32_t *)usecase1_Data1,
//                         strlen((const char *)(usecase1_Data1)),
//                         &Read_CRCResult32);
//  XMC_FCE_GetCRCResult(p_fce, &CRC_result);
//  printf("Result: %08X\n", CRC_result);

//  p_fce = &FCE_config04;
//  XMC_FCE_Init(p_fce);
//  XMC_FCE_CalculateCRC32(p_fce, (uint32_t *)usecase1_Data1,
//                         strlen((const char *)(usecase1_Data1)),
//                         &Read_CRCResult32);
//  XMC_FCE_GetCRCResult(p_fce, &CRC_result);
//  printf("Result: %08X\n", CRC_result);

//  p_fce = &FCE_config05;
//  XMC_FCE_Init(p_fce);
//  XMC_FCE_CalculateCRC32(p_fce, (uint32_t *)usecase1_Data1,
//                         strlen((const char *)(usecase1_Data1)),
//                         &Read_CRCResult32);
//  XMC_FCE_GetCRCResult(p_fce, &CRC_result);
//  printf("Result: %08X\n", CRC_result);

//  p_fce = &FCE_config06;
//  XMC_FCE_Init(p_fce);
//  XMC_FCE_CalculateCRC32(p_fce, (uint32_t *)usecase1_Data1,
//                         strlen((const char *)(usecase1_Data1)),
//                         &Read_CRCResult32);
//  XMC_FCE_GetCRCResult(p_fce, &CRC_result);
//  printf("Result: %08X\n", CRC_result);

//  p_fce = &FCE_config07;
//  XMC_FCE_Init(p_fce);
//  XMC_FCE_CalculateCRC32(p_fce, (uint32_t *)usecase1_Data1,
//                         strlen((const char *)(usecase1_Data1)),
//                         &Read_CRCResult32);
//  XMC_FCE_GetCRCResult(p_fce, &CRC_result);
//  printf("Result: %08X\n", CRC_result);

//  p_fce = &FCE_config08;
//  XMC_FCE_Init(p_fce);
//  XMC_FCE_CalculateCRC32(p_fce, (uint32_t *)usecase1_Data1,
//                         strlen((const char *)(usecase1_Data1)),
//                         &Read_CRCResult32);
//  XMC_FCE_GetCRCResult(p_fce, &CRC_result);
//  printf("Result: %08X\n", CRC_result);

//  p_fce = &FCE_config09;
//  XMC_FCE_Init(p_fce);
//  XMC_FCE_CalculateCRC32(p_fce, (uint32_t *)usecase1_Data1,
//                         strlen((const char *)(usecase1_Data1)),
//                         &Read_CRCResult32);
//  XMC_FCE_GetCRCResult(p_fce, &CRC_result);
//  printf("Result: %08X\n", CRC_result);

//  p_fce = &FCE_config0A;
//  XMC_FCE_Init(p_fce);
//  XMC_FCE_CalculateCRC32(p_fce, (uint32_t *)usecase1_Data1,
//                         strlen((const char *)(usecase1_Data1)),
//                         &Read_CRCResult32);
//  XMC_FCE_GetCRCResult(p_fce, &CRC_result);
//  printf("Result: %08X\n", CRC_result);

//  p_fce = &FCE_config0B;
//  XMC_FCE_Init(p_fce);
//  XMC_FCE_CalculateCRC32(p_fce, (uint32_t *)usecase1_Data1,
//                         strlen((const char *)(usecase1_Data1)),
//                         &Read_CRCResult32);
//  XMC_FCE_GetCRCResult(p_fce, &CRC_result);
//  printf("Result: %08X\n", CRC_result);

//  p_fce = &FCE_config0C;
//  XMC_FCE_Init(p_fce);
//  XMC_FCE_CalculateCRC32(p_fce, (uint32_t *)usecase1_Data1,
//                         strlen((const char *)(usecase1_Data1)),
//                         &Read_CRCResult32);
//  XMC_FCE_GetCRCResult(p_fce, &CRC_result);
//  printf("Result: %08X\n", CRC_result);

//  p_fce = &FCE_config0D;
//  XMC_FCE_Init(p_fce);
//  XMC_FCE_CalculateCRC32(p_fce, (uint32_t *)usecase1_Data1,
//                         strlen((const char *)(usecase1_Data1)),
//                         &Read_CRCResult32);
//  XMC_FCE_GetCRCResult(p_fce, &CRC_result);
//  printf("Result: %08X\n", CRC_result);

//  p_fce = &FCE_config0E;
//  XMC_FCE_Init(&FCE_config0E);
//  XMC_FCE_CalculateCRC32(&FCE_config0E, (uint32_t *)usecase1_Data1,
//                         strlen((const char *)(usecase1_Data1)),
//                         &Read_CRCResult32);
//  XMC_FCE_GetCRCResult(&FCE_config0E, &CRC_result);
//  printf("Result: %08X\n", CRC_result);

//  p_fce = &FCE_config0F;
//  XMC_FCE_Init(p_fce);
//  XMC_FCE_CalculateCRC32(p_fce, (uint32_t *)usecase1_Data1,
//                         strlen((const char *)(usecase1_Data1)),
//                         &Read_CRCResult32);
//  XMC_FCE_GetCRCResult(p_fce, &CRC_result);
//  printf("Result: %08X\n", CRC_result);

//  printf("\n");
//  p_fce = &FCE_config00;
//  XMC_FCE_Init(p_fce);
//  XMC_FCE_CalculateCRC32(p_fce, (uint32_t *)usecase1_Data4,
//                         strlen((const char *)(usecase1_Data4)),
//                         &Read_CRCResult32);
//  XMC_FCE_GetCRCResult(p_fce, &CRC_result);
//  printf("Result: %08X\n", CRC_result);

//  p_fce = &FCE_config01;
//  XMC_FCE_Init(p_fce);
//  XMC_FCE_CalculateCRC32(p_fce, (uint32_t *)usecase1_Data4,
//                         strlen((const char *)(usecase1_Data4)),
//                         &Read_CRCResult32);
//  XMC_FCE_GetCRCResult(p_fce, &CRC_result);
//  printf("Result: %08X\n", CRC_result);

