zhanzr/xmc4700-relax-kit-demo/crc_perf.c
//  p_fce = &FCE_config02;
//  XMC_FCE_Init(p_fce);
//  XMC_FCE_CalculateCRC32(p_fce, (uint32_t *)usecase1_Data4,
//                         strlen((const char *)(usecase1_Data4)),
//                         &Read_CRCResult32);
//  XMC_FCE_GetCRCResult(p_fce, &CRC_result);
//  printf("Result: %08X\n", CRC_result);

//  p_fce = &FCE_config03;
//  XMC_FCE_Init(p_fce);
//  XMC_FCE_CalculateCRC32(p_fce, (uint32_t *)usecase1_Data4,
//                         strlen((const char *)(usecase1_Data4)),
//                         &Read_CRCResult32);
//  XMC_FCE_GetCRCResult(p_fce, &CRC_result);
//  printf("Result: %08X\n", CRC_result);

//  p_fce = &FCE_config04;
//  XMC_FCE_Init(p_fce);
//  XMC_FCE_CalculateCRC32(p_fce, (uint32_t *)usecase1_Data4,
//                         strlen((const char *)(usecase1_Data4)),
//                         &Read_CRCResult32);
//  XMC_FCE_GetCRCResult(p_fce, &CRC_result);
//  printf("Result: %08X\n", CRC_result);

//  p_fce = &FCE_config05;
//  XMC_FCE_Init(p_fce);
//  XMC_FCE_CalculateCRC32(p_fce, (uint32_t *)usecase1_Data4,
//                         strlen((const char *)(usecase1_Data4)),
//                         &Read_CRCResult32);
//  XMC_FCE_GetCRCResult(p_fce, &CRC_result);
//  printf("Result: %08X\n", CRC_result);

//  p_fce = &FCE_config06;
//  XMC_FCE_Init(p_fce);
//  XMC_FCE_CalculateCRC32(p_fce, (uint32_t *)usecase1_Data4,
//                         strlen((const char *)(usecase1_Data4)),
//                         &Read_CRCResult32);
//  XMC_FCE_GetCRCResult(p_fce, &CRC_result);
//  printf("Result: %08X\n", CRC_result);

//  p_fce = &FCE_config07;
//  XMC_FCE_Init(p_fce);
//  XMC_FCE_CalculateCRC32(p_fce, (uint32_t *)usecase1_Data4,
//                         strlen((const char *)(usecase1_Data4)),
//                         &Read_CRCResult32);
//  XMC_FCE_GetCRCResult(p_fce, &CRC_result);
//  printf("Result: %08X\n", CRC_result);

//  p_fce = &FCE_config08;
//  XMC_FCE_Init(p_fce);
//  XMC_FCE_CalculateCRC32(p_fce, (uint32_t *)usecase1_Data4,
//                         strlen((const char *)(usecase1_Data4)),
//                         &Read_CRCResult32);
//  XMC_FCE_GetCRCResult(p_fce, &CRC_result);
//  printf("Result: %08X\n", CRC_result);

//  p_fce = &FCE_config09;
//  XMC_FCE_Init(p_fce);
//  XMC_FCE_CalculateCRC32(p_fce, (uint32_t *)usecase1_Data4,
//                         strlen((const char *)(usecase1_Data4)),
//                         &Read_CRCResult32);
//  XMC_FCE_GetCRCResult(p_fce, &CRC_result);
//  printf("Result: %08X\n", CRC_result);

//  p_fce = &FCE_config0A;
//  XMC_FCE_Init(p_fce);
//  XMC_FCE_CalculateCRC32(p_fce, (uint32_t *)usecase1_Data4,
//                         strlen((const char *)(usecase1_Data4)),
//                         &Read_CRCResult32);
//  XMC_FCE_GetCRCResult(p_fce, &CRC_result);
//  printf("Result: %08X\n", CRC_result);

//  p_fce = &FCE_config0B;
//  XMC_FCE_Init(p_fce);
//  XMC_FCE_CalculateCRC32(p_fce, (uint32_t *)usecase1_Data4,
//                         strlen((const char *)(usecase1_Data4)),
//                         &Read_CRCResult32);
//  XMC_FCE_GetCRCResult(p_fce, &CRC_result);
//  printf("Result: %08X\n", CRC_result);

//  p_fce = &FCE_config0C;
//  XMC_FCE_Init(p_fce);
//  XMC_FCE_CalculateCRC32(p_fce, (uint32_t *)usecase1_Data4,
//                         strlen((const char *)(usecase1_Data4)),
//                         &Read_CRCResult32);
//  XMC_FCE_GetCRCResult(p_fce, &CRC_result);
//  printf("Result: %08X\n", CRC_result);

//  p_fce = &FCE_config0D;
//  XMC_FCE_Init(p_fce);
//  XMC_FCE_CalculateCRC32(p_fce, (uint32_t *)usecase1_Data4,
//                         strlen((const char *)(usecase1_Data4)),
//                         &Read_CRCResult32);
//  XMC_FCE_GetCRCResult(p_fce, &CRC_result);
//  printf("Result: %08X\n", CRC_result);

//  p_fce = &FCE_config0E;
//  XMC_FCE_Init(&FCE_config0E);
//  XMC_FCE_CalculateCRC32(&FCE_config0E, (uint32_t *)usecase1_Data4,
//                         strlen((const char *)(usecase1_Data4)),
//                         &Read_CRCResult32);
//  XMC_FCE_GetCRCResult(&FCE_config0E, &CRC_result);
//  printf("Result: %08X\n", CRC_result);

//  p_fce = &FCE_config0F;
//  XMC_FCE_Init(p_fce);
//  XMC_FCE_CalculateCRC32(p_fce, (uint32_t *)usecase1_Data4,
//                         strlen((const char *)(usecase1_Data4)),
//                         &Read_CRCResult32);
//  XMC_FCE_GetCRCResult(p_fce, &CRC_result);
//  printf("Result: %08X\n", CRC_result);
//  printf("\n");
//  /* Step 2: Performs a CRC32 check using Kernel 1 on Usecase1_Data1
//   * Seed value is set to 0. CRC check comparison is enabled
//   * CRC checksum is using result from earlier CRC check
//   * No CRC mismatch found.
//   * CRC = 0xbb8d49a6, RES = 0xbb8d49a6
//   */
//  XMC_FCE_EnableOperation(&FCE_config1, XMC_FCE_CFG_CONFIG_CCE);

//  /* Used in 32bit FCE, therefore temp_length is divided by 4*/
//  temp_length = (strlen((char *)(usecase1_Data1))) >> 2;
//  XMC_FCE_UpdateCRCCheck(&FCE_config1, Read_CRCResult32);
//  XMC_FCE_UpdateLength(&FCE_config1, temp_length);

//  XMC_FCE_InitializeSeedValue(&FCE_config1, 0);
//  fce_status = XMC_FCE_CalculateCRC32(&FCE_config1, (uint32_t *)usecase1_Data1,
//                                      strlen((const char *)(usecase1_Data1)),
//                                      &Read_CRCResult32);
//  while (fce_status == XMC_FCE_STATUS_ERROR) {

//    Error_Handler();
//  }

//  XMC_FCE_GetCRCResult(&FCE_config1, &CRC_result);
//  printf("Result: %08X\n", CRC_result);
//  if (XMC_FCE_GetEventStatus(&FCE_config1, XMC_FCE_STS_MISMATCH_CRC)) {
//    temp_mismatch += 1U;
//  }

//  /* Step 3: Performs a CRC32 check using Kernel 1 on Usecase1_Data2
//   * Seed value is set to 0. CRC check comparison is enabled
//   * CRC checksum is using result from earlier CRC check
//   * CRC mismatch found and Length Error found.
//   * CRC = 0x8f2d7440, RES = 0x8f2d7440
//   */
//  XMC_FCE_InitializeSeedValue(&FCE_config1, 0);
//  XMC_FCE_UpdateLength(&FCE_config1, temp_length);

//  fce_status = XMC_FCE_CalculateCRC32(&FCE_config1, (uint32_t *)usecase1_Data2,
//                                      strlen((const char *)(usecase1_Data2)),
//                                      &Read_CRCResult32);
//  while (fce_status == XMC_FCE_STATUS_ERROR) {

//    Error_Handler();
//  }

//  XMC_FCE_GetCRCResult(&FCE_config1, &CRC_result);
//  printf("Result: %08X\n", CRC_result);
//  if (XMC_FCE_GetEventStatus(&FCE_config1, XMC_FCE_STS_MISMATCH_CRC)) {
//    temp_mismatch += 2U;
//  }

