zhanzr/xmc4700-relax-kit-demo/crc_perf.c
  /* Step 4: Performs a CRC16 check using Kernel 2 on Usecase1_Data3
   * Seed value is set to 0.
   * CRC = 0x191e, RES = 0x191e
   */
	
	printf(usecase1_Data1);
	printf("\n");
	printf(usecase1_Data2);
	printf("\n");
	printf(usecase1_Data3);
	printf("\n");
	printf(usecase1_Data4);
	printf("\n");
	
	p_fce = &g_FCE_2;
  XMC_FCE_Init(p_fce);
//  XMC_FCE_InitializeSeedValue(p_fce, 0xffff);
  fce_status = XMC_FCE_CalculateCRC16Ex(p_fce, usecase1_Data1, strlen(usecase1_Data1),
                                      &Read_CRCResult16);
  while (fce_status == XMC_FCE_STATUS_ERROR) {
    Error_Handler();
  }
  printf("Result: %04X\n", Read_CRCResult16);	

	p_fce = &g_FCE_2;
  XMC_FCE_Init(p_fce);
//  XMC_FCE_InitializeSeedValue(p_fce, 0xffff);
  printf("engine:%p, cfg:%08X, init:%08X\n", p_fce->kernel_ptr, p_fce->fce_cfg_update.regval, p_fce->seedvalue);
  fce_status = XMC_FCE_CalculateCRC16Ex(p_fce, usecase1_Data2, strlen(usecase1_Data2),
                                      &Read_CRCResult16);
  while (fce_status == XMC_FCE_STATUS_ERROR) {
    Error_Handler();
  }
  printf("Result: %04X\n", Read_CRCResult16);	

	p_fce = &g_FCE_2;
  XMC_FCE_Init(p_fce);
//  XMC_FCE_InitializeSeedValue(p_fce, 0xffff);
  printf("engine:%p, cfg:%08X, init:%08X\n", p_fce->kernel_ptr, p_fce->fce_cfg_update.regval, p_fce->seedvalue);
  fce_status = XMC_FCE_CalculateCRC16Ex(p_fce, usecase1_Data3, strlen(usecase1_Data3),
                                      &Read_CRCResult16);
  while (fce_status == XMC_FCE_STATUS_ERROR) {
    Error_Handler();
  }
  printf("Result: %04X\n", Read_CRCResult16);	

	p_fce = &g_FCE_2;
  XMC_FCE_Init(p_fce);
//  XMC_FCE_InitializeSeedValue(p_fce, 0xffff);
  printf("engine:%p, cfg:%08X, init:%08X\n", p_fce->kernel_ptr, p_fce->fce_cfg_update.regval, p_fce->seedvalue);
  fce_status = XMC_FCE_CalculateCRC16Ex(p_fce, usecase1_Data4, strlen(usecase1_Data4),
                                      &Read_CRCResult16);
  while (fce_status == XMC_FCE_STATUS_ERROR) {
    Error_Handler();
  }
  printf("Result: %04X\n", Read_CRCResult16);	

	p_fce = &g_FCE_2;
  XMC_FCE_Init(p_fce);
//  XMC_FCE_InitializeSeedValue(p_fce, 0xffff);
  printf("engine:%p, cfg:%08X, init:%08X\n", p_fce->kernel_ptr, p_fce->fce_cfg_update.regval, p_fce->seedvalue);
  fce_status = XMC_FCE_CalculateCRC16Ex(p_fce, test_vec5, sizeof(test_vec5),
                                      &Read_CRCResult16);
  while (fce_status == XMC_FCE_STATUS_ERROR) {
    Error_Handler();
  }
  printf("Result: %04X\n", Read_CRCResult16);	
	

	uint16_t res0 = crc16_algorithm_2(0xffff, usecase1_Data1, strlen(usecase1_Data1));
	printf("Ref value:%04X\n", res0);

	uint16_t res1 = crc16_algorithm_2(0xffff, usecase1_Data2, strlen(usecase1_Data2));
	printf("Ref value:%04X\n", res1);
	
	uint16_t res2 = crc16_algorithm_2(0xffff, usecase1_Data3, strlen(usecase1_Data3));
	printf("Ref value:%04X\n", res2);
	
	uint16_t res3 = crc16_algorithm_2(0xffff, usecase1_Data4, strlen(usecase1_Data4));
	printf("Ref value:%04X\n", res3);
	
	uint16_t res5 = crc16_algorithm_2(0xffff, test_vec5, sizeof(test_vec5));
	printf("Ref value:%04X\n", res5);	
  /* Step 5: Performs a CRC8 check using Kernel 3 on Usecase1_Data4
   * Seed value is set to 0. CRC = 0xbe, RES = 0xbe
   */
  XMC_FCE_InitializeSeedValue(&FCE_config3, 0);
  fce_status = XMC_FCE_CalculateCRC8(&FCE_config3, (uint8_t *)usecase1_Data3,
                                     strlen((const char *)(usecase1_Data3)),
                                     &Read_CRCResult8);
  while (fce_status == XMC_FCE_STATUS_ERROR) {

    Error_Handler();
  }
  printf("Result: %08X\n", Read_CRCResult8);

  /* Step 6: Trigger a mismatch flag
   */
  flagstatus = XMC_FCE_GetEventStatus(&FCE_config3, XMC_FCE_STS_MISMATCH_CRC);
  while (flagstatus) {
    /* endless loop if mismatch flag is triggered */
  }
  XMC_FCE_TriggerMismatch(&FCE_config3, XMC_FCE_CTR_MISMATCH_CRC);
  flagstatus = XMC_FCE_GetEventStatus(&FCE_config3, XMC_FCE_STS_MISMATCH_CRC);
  while (flagstatus) {
    printf("mismatch flag is triggered\n");
    Error_Handler();
  }
}
